that
sounds
awesome
i
ll
check
it
out
tonight
hope
has
voice
support
so
can
say

engage
haha
star
trek
tos
50th
anniversary
tribute
game
needs
beta
feedback
download
here
http
gambitrealmcominstallerdownload_release45_vrphp
features
all
decks
exploration
mission
entire
ship
accessible
15
training
missions
goldredblue
shirts
each
get
5
skill
tiers
interactive
episodes
watch
clips
and
then
take
control
of
the
action
turbolift
shafts
go
from
top
to
bottom
within
deck
6
movie
theater
trailers
in
full
oculus
rift
dk1
tested
controller
completed
unlocks
a
new
character
play
unlocked
characters
access
specific
things
tier
an
episode
fly
enterprise
beam
planets
space
stations
warp
other
locations
see
approaching
developer
forum
discussion
forumstorque3dorgviewtopicphp
f
17amp
t
551
gallery
imgurcomaxbo2w
am
not
associated
with
project
just
fan
would
nt
spock
have
found
bit
insulting
been
referred
as
most
human
soul
kirk
had
encountered
love
scene
but
quote
always
seemed
slightly
off
me
thoughts
was
half
worked
for
some
time
on
understanding
feeling
showing
his
emotions
heartfelt
compliment
taken
m
sure
got
notice
audible
this
afternoon
book
uwilliamshatner
about
leonard
released
know
what
will
be
listening
car
week
wwwamazoncomleonardfiftyyearfriendshipremarkablemandp1250083311
wwwaudiblecompdartsentertainmentleonardaudiobookb019zx7wh6
kinda
parts
proceeds
charity
or
else
my
unimportant
opinion
its
kind
morally
questionable
thing
make
money
next
generation
final
7937
days
ago
original
series
18056
thought
putting
offers
perspective
first
viewing
voyager
is
probably
one
funniest
seen
far
there
are
pure
comedy
takes
cake
doctor
such
lovable
looking
parmac
spelling
wrong
places
our
man
bashir
little
green
men
barclay
tng
when
he
goes
james
bondish
bride
chaotica
mmm
those
come
mind
right
now
certain
others
45
minutes
grinning
laughing
few
serious
moments
catch
your
breath
like
way
something
lighthearted
fun
amidst
starfleet
protocol
anyway
season
better
than
people
does
problems
if
you
watching
starship
travel
faster
speed
light
extra
shuttlecrafts
writers
hangover
once
while
should
main
focus
caracters
great
every
even
they
start
very
lame
unlikable
grow
lot
neelix
example
piccard
s1e1
dick
tucker
generic
texas
boy
uggghhh
sisko
idea
getting
close
complete
whole
voyage
forward
july
more
2017
llap
took
quite
into
ended
up
enjoying
much
still
good
memories
wasnt
angry
at
forced
plot
trip
tpol
blatent
obscene
sexing
her
unlike
many
enjoyed
long
arch
expanse
anyhow
enough
scratch
itch
havent
gotten
through
ds9
yet
mainly
because
religious
stuff
hard
palate
s
trangressions
imagine
tame
comparison
non
since
ive
watched
them
apart
remainder
trying
babylon
again
alot
rave
reviews
high
sci
fi
cred
read
dont
expect
super
special
effects
show
low
budget
find
jarring
saw
ant
creature
bad
sets
seem
cramped
gives
impression
being
filmed
someones
backyard
garage
keep
though
maybe
smooth
mean
before
by
years
nearly
looked
classy
battlestar
galactica
after
seems
mockery
genre
grotesquely
overrated
feel
everything
life
continued
downhill
millenium
gold
80s
90s
andromeda
looks
sleeper
hit
rader
ye
stalwarts
satisfy
yearning
heart
said
twice
already
deserves
reinforcing
stick
b5
rough
second
picks
londo
gkar
become
garibaldi
ivanova
pretty
too
station
commander
plus
crossover
actors
walter
koenig
plays
phenomenal
villainous
psicorps
villain
majel
barrett
roddenberry
centauri
emperor
wife
andreas
katsulas
who
romulan
tomalak
several
d
share
community
how
big
small
1701
compared
supercarrier
images
imgurcomgallery0oknm
17060
turnabout
intruder
https
enwikipediaorgwikiturnabout_intruder
june
3
1969
february
14
2016
includes
leap
between
until
think
re
calculating
date
aired
trap
cool
any
companies
made
1350
scale
ft
hell
model
glad
did
humour
really
well
addition
two
mentioned
also
message
bottle
line
fast
prosper
living
witness
body
someone
over
author
actually
last
broke
damn
theme
song
happy
coy
bubbly
worst
part
listen
times
begin
following
films
tv
without
spinoffs
voy
ent
1
generations
1994
2
contact
1996
insurrection
1998
4
nemesis
2002
wondering
presented
these
type
events
usually
end
tostng
lovefest
came
back
unfamiliar
st
worth
going
live
orchestra
alone
hours
intermission
screen
shows
movies
cut
peace
music
notated
michael
dorn
dates
case
interested
startrekultimatevoyagecomtour
wonder
where
35mm
footage
tour
ve
hd
blurays
greetings
captains
258
priority
podcast
priorityonepodcastcompo258
weekly
report
recorded
thursday
11th
available
streaming
monday
15th
priorityonepodcastcom
amp
nbsp
we
trekking
showrunner
named
william
shatner
aging
captain
bringing
latest
con
news
online
mark
giving
us
lowdown
brand
flagships
announced
later
cookie
elijah
playing
hide
q
finally
graphic
artist
henry
another
art
review
usual
wrap
open
hailing
frequencies
incoming
messages
topics
discussed
bryan
fuller
wwwwiredcom201602bryanfullerstartrekseries
wwwhollywoodreportercomheatvisionwilliamshatnerisreadyreturn862167
update
tickets
york
sale
18th
wwwfacebookcomevents1937858536439995permalink1946617888897393
destination
europe
announcing
guests
wednesday
17th
photoshoot
march
1st
wwwdestinationstartrekcom
wrath
gems
itunesapplecomgbappstartrekwrathofgemsid959515619
mt
8
federation
wwwarcgamescomengamesstartrekonlinenewsdetail9782283startrekonline
3afederationflagships
klingon
wwwarcgamescomengamesstartrekonlinenewsdetail9782843
wwwarcgamescomengamesstartrekonlinenewsdetail9782983
release
notes
wwwarcgamescomengamesstartrekonlinenewsdetail9785093startrekonline
3areleasenotes
3afebruary11th2016
tracking
devs
thomas
marrone
indepth
look
inuniverse
magazine
article
inddadobecomview5d7ffcd87cf84561a13a5df451ef0511
via
memory
alpha
memoryalphawikiacomwikihide_and_q_
making
geordi
laforge
visor
wwwstartrekcomwatch_videomakingoftngpropsgeordisvisorthe
earpiece
wwwthingiversecomthing
249509
core
lamp
327114
set
1275400
handle
stamps
5676
question
gt
cameo
picked
power
do
different
deanna
involved
she
influenced
riker
differently
gift
given
let
commenting
below
visit
youtube
channel
subscribe
premier
wwwyoutubecomuserp1network
productions
team
members
passion
please
positions
volunteer
offer
wellknown
outlet
work
believe
could
enhance
content
send
information
experience
along
writing
samples
miss
blogs
stop
link
priorityonepodcastcomcategoryarticles
yourself
video
follow
social
media
sites
facebook
head
wwwfacebookcompriorityonepodcast
hi
twitter
priorityonepod
twittercompriorityonepod
liked
totally
hated
leave
comment
priorityonepodcastcomfeedback
handy
web
form
enjoy
why
songs
lyrics
hate
alarm
tune
nothing
gets
bed
karaoked
las
vegas
convention
sort
ca
fact
rod
stewart
done
care
anyone
says
humans
fits
perfectly
down
road
die
data
gathered
invaluable
eventually
help
save
thousands
lives
stargate
definitely
nerdy
militaristic
cases
funny
ever
argument
both
own
separate
reasons
matters
definition
attracts
nerds
simply
oneil
wants
call
build
remember
techno
babble
dude
belt
buckle
forehead
disputed
planet
cease
fire
only
called
weytahn
andorians
paan
mokar
vulcans
rewatching
bobw
noticed
reached
sol
ordered
slow
impulse
stay
otherwise
spend
intercept
borg
cube
allow
ftl
slower
manner
reminded
beginning
tuc
sulu
excelsior
heading
home
elite
dangerous
ways
system
huge
jump
systems
essentially
clueless
opinions
use
terminology
supercruise
except
deliver
similar
jumping
arguing
which
nerdiest
plots
cross
place
entirely
galaxy
personally
recommend
simultaneously
template
golden
age
television
development
serialization
fantastic
prefer
immersed
suck
vote
separately
elsewhere
panic
disco
unnecessary
amazon
license
renewal
everyone
went
halfcocked
speculating
cbs
pulling
moving
relax
folks
grab
drink
chill
almost
away
rule
guess
crowded
areas
ships
gravitational
sources
risk
field
disrupted
higher
precision
stopping
dime
9
orbit
problematic
run
achieve
stable
sustained
under
force
black
hole
cores
coming
blind
result
debris
nutshell
used
sublight
speeds
capable
achieving
vi
undiscovered
country
likely
error
explanations
conceived
regards
best
worlds
wildly
inconsistent
versus
dialogue
established
multiple
safety
concerns
however
visually
worse
crew
atmosphere
earth
iv
no
downside
beside
shift
quality
style
problem
either
initially
broadcast
recent
chronological
rewatch
amount
overlap
pilot
involves
fairly
minor
background
elements
wo
difference
order
bits
same
context
production
expected
approach
highly
measurements
apparently
measuring
maximum
output
vessel
engines
rather
measurement
shuttle
technical
manual
lists
14th
assume
enterprised
capability
although
theirs
may
dropping
around
neptune
put
billion
kms
wolfram
60042
seconds
1001
1668
closer
saturn
4725
jupiter
233
shave
considerable
estimate
course
scotty
saying
simple
interstellar
capabilities
tl
dr
clear
thanks
played
kid
games
windows
31
pc
alien
encounter
destroyed
phaser
banks
volley
_
screenwriter
generally
speaking
stars
instances
conveniently
id
dropped
four
drive
regular
combat
microjump
lets
depending
fuel
range
galactic
phew
afraid
list
ends
thestartrekchronologyprojectblogspotcom200909andnowwepresentcompletestartrek_19html
excited
moment
realized
ega
wow
school
tobias
richter
archiveorg
pointless
sign
doomed
uncle
computing
reminds
him
interesting
execution
kicks
real
possibility
eventuality
fans
clamoring
free
lunch
network
pennies
dollar
upset
creators
stand
day
beyond
wait
disney
crazy
buying
netflix
their
personal
platform
chaos
unfold
family
computer
w31
talking
angle
torpedoes
want
certainly
subscriptions
need
brother
young
software
engineer
amazed
phasers
based
casting
occurred
worried
storyline
exists
nowhere
gay
fine
sexuality
constantly
spotlighted
subtle
freaking
person
relationship
gender
deal
completely
normal
attention
00s
transparent
ordinary
female
highlight
antigay
member
continue
ridiculous
debate
whether
treat
obvious
24th
century
nobody
give
single
shit
never
understood
trouble
affects
works
pillowfight
swordfight
examples
hitting
object
tends
somebody
bleeding
death
unless
pillowfights
hardcore
angela
bassett
officer
rosario
dawson
lesbian
were
hoping
pumped
world
modern
return
reboot
patrick
jonathan
frakes
five
year
beat
rest
girl
manage
agreed
ranking
edit
clarity
agree
partner
halfway
ranks
tho
picard
janeway
archer
oh
yeah
favourite
magnificent
ferengi
finds
reeling
cancellation
started
info
story
aspect
substory
heavily
followed
growth
civilization
lines
peppered
crappy
timelines
affected
loop
alternate
universe
shown
audience
matter
yes
prime
enterprisec
timeline
creates
accept
canon
defines
uhmsbountya
distinction
forms
moot
picture
wellresearched
semantics
reality
possible
occurring
define
disappointing
conclusion
experiment
niners
subreddit
nope
margin
ta
neck
understand
sell
2001
tech
pretos
explanation
lovely
lcd
screens
nicely
designed
weapons
future
fluid
anything
gen
above
difficult
job
blowing
60
dated
less
audiences
buy
design
100
old
continuity
era
exist
figure
older
counter
warfare
during
earthromulan
war
supported
sub
favors
spot
tas
correction
feb
16
harddawncom
parody
website
immediately
actual
source
satirical
harddawncomnimoyandobamakilledscalia
holy
irrational
simon
pegg
astounding
pr
darkness
told
confirm
kahn
ruined
trailer
reflect
terrible
yo
calm
fuck
odd
written
italian
google
translates
everywhere
appeals
explore
redemption
ii
solid
battles
shine
darmok
helped
universal
translator
view
language
culture
exchange
kept
avoid
dull
ensign
ro
bajorans
important
intro
nice
saved
silicon
avatar
journey
discovering
revenge
neglecting
ending
bold
disaster
unusual
pairings
ok
particularly
desire
wesley
creepy
mine
unification
seeing
itself
engaging
throughout
weaker
sela
showed
overall
honor
watchable
conman
interactions
rasmussen
problemsolving
dilemma
ground
fandom
alexander
actor
acts
foil
worf
brings
standard
hero
worship
substance
child
fluff
scenes
violations
weird
rape
engaged
masterpiece
society
terribly
troi
romances
boring
unbelievably
dumb
morality
discussions
conundrum
concept
explored
surprisingly
chemistry
mystery
executed
possesed
bangup
hose
roles
caper
dislike
ethics
drama
soapy
crusher
ellen
degeneres
android
clone
ellenbot
3000
varied
nature
provided
viewpoint
believable
kill
walking
outcast
safe
wellexplored
wonderfully
horrible
reminiscent
city
edge
forever
soren
genuine
cause
effect
loved
looping
directed
across
chance
duty
allowed
forget
former
position
having
absolutely
fuming
choice
insight
everyday
cost
uhhhhhhh
alexandermama
holodeck
twat
lwaxana
husbandtobe
perfect
mate
presenting
metamorph
kamala
cared
seducing
various
huh
imaginary
friend
fucking
children
doing
groaning
mixes
acting
cassandra
truth
clich
particular
pet
peeve
moral
issue
develops
response
prejudice
individuality
points
hugh
develop
sad
ambiguous
hopeful
phase
funeral
planning
sweet
starting
inner
aka
becomes
jorel
popular
wanted
fondness
arrow
wonderful
french
inventor
reaction
might
misremember
rating
330
write
favourable
aorund
turns
circle
jerk
lied
earlier
legit
admittedly
heavy
empath
vians
related
talosians
large
cerebrums
aliens
experiments
create
illusions
figured
happens
advanced
underground
veiny
psychic
powers
mess
turn
glowing
ball
energy
faith
delivers
himself
touch
lived
ideals
humanity
met
deep
7
wish
talos
cage
paradise
shore
unknown
asteroid
gamma
canaris
region
metamorphosis
kelvin
name
sargon
tomorrow
holberg
917g
requiem
methuselah
face
faceswap
photoshopped
onto
okay
command
test
gain
ability
official
bridge
raising
lt
directly
chain
3rd
holding
watches
point
required
assuming
role
outside
picardrikerdataworf
assumption
talked
officially
counselor
sense
feelings
viewscreen
tests
advance
rank
advisor
counsellor
direct
include
division
medical
duties
decided
officers
memoryalphawikiacomwikibridge_officer
27s_test
trois
promotion
gave
board
confusing
promotions
hq
navy
approved
denied
conn
holder
elective
staff
nonline
eligible
topic
reading
comments
makes
quadrant
operations
surely
qualified
harry
manager
entertaining
skip
uninteresting
challenging
bother
tell
instead
focuses
struggle
basic
remembers
anywhere
brain
invented
confederate
service
ethnically
homogeneous
executive
halfcaucasian
halfblack
fleet
reads
souls
travels
breaks
white
truest
kkkirk
posted
wwwredditcomrstartrekcomments463qouso_isolinear_chips_are_almost_here
optolythic
rods
isolinear
chips
box
whatever
loss
personnel
science
track
canonical
evidence
additional
certifications
commissioned
study
attain
analogous
cadets
academy
engineering
extension
courses
likewise
considered
sciences
jeffrey
combs
capacity
lee
pace
chi
mcbride
pushing
daisies
guardians
recurring
guy
known
likes
bring
previous
communityewcom20150603bryanfullerrecurringactors
appeared
hannibal
eddie
izzard
sometimes
mudd
jewel
staite
gina
torres
firefly
sf
levar
burton
nerdist
basically
nonstereotypical
including
sex
count
stated
annoyed
third
redid
seriously
unique
script
recently
rewatched
motion
frontier
v
considerably
director
film
rehashing
franchise
trend
criticism
individual
political
constructive
cinema
critique
curious
undermined
rebooting
rehash
regarding
tmptff
thrilling
tendency
talky
ultimately
mile
wide
inch
rehashes
ideas
tmp
tff
least
try
ish
table
overblown
khan
remake
period
retreads
general
decades
commits
unforgivable
sin
merit
commited
crime
weigh
camp
value
hilarious
plain
makin
belly
uhnari
leah
brahms
10
landing
p
kira
uhura
roommate
2009
dtf
brought
dorm
room
promised
highest
probability
successful
dax
jadzia
ezri
talk
occupation
resistance
movements
survival
skills
trill
mostly
using
excuse
conversations
red
shits
survive
weeks
uninhabited
island
extras
receiving
dead
jim
hear
stuck
easy
beatuiful
risa
shame
worries
running
supplies
snap
adventure
somewhere
perceptions
values
checked
phaserandwarpdrive
wrapper
leeway
24
hour
ramifications
directive
projected
forhead
ridges
execs
breathing
numbers
intriguing
communicates
limmericks
poignancy
twist
mirrors
current
scandal
fill
seats
stid
divisive
nonfans
authority
buffs
vocal
despite
apparent
flaws
perception
opposite
reasonably
strong
characterization
trio
suffers
greatly
stripped
strelated
baggage
subbing
mccoy
weak
khaaan
dance
awful
sybok
nuanced
lacked
menace
danger
managed
complain
magic
blood
seemingly
sillier
embellishments
featured
greeks
nazis
guntoting
romans
lincoln
giant
blackops
cryogenics
downright
obviously
classic
70s
retro
modelmaker
loves
montage
campy
suspend
belief
faithful
derivative
overtly
fanpatronizing
wars
viii
severely
overhated
ridiculously
competentand
memoryalphawikiacomwikikamala
eat
sleep
fix
arise
knows
entertain
guys
awkwardly
fail
hooking
ladies
hand
coconut
radio
food
replicator
logical
answer
pervert
smart
resourceful
pass
rescued
thinking
obrien
dirty
pissed
miserable
killing
survivor
numerous
situations
keeps
positive
attitude
water
scarcity
tastes
crap
yeoman
colt
hot
redhead
unusually
drives
archaeology
geek
daniel
jackson
pop
archaeologist
grave
robber
vulcan
occasionally
vulcania
vulcanians
names
natives
40
eridani
instance
heard
reason
naming
translating
upcoming
spirit
gene
vision
jj
reboots
dynamic
tog
meaningful
references
prior
enterprises
woman
center
male
personality
american
south
louisiana
datatype
droid
helmsmen
andorian
tactical
japanese
cultural
ties
ancient
samurai
yogi
buddhist
11
chief
cardassian
assistant
emh
program
periodical
appearances
12
russian
speaks
fluent
english
discarding
extended
wiki
la
cardassia
joined
destruction
committed
rebuilding
peaceful
antiwar
ruin
fighting
dominian
empire
struggled
rebuild
armament
buildup
regain
mighty
warriors
lost
neutral
zone
romulans
situation
unchanged
slowly
expanding
side
territory
formed
temporary
alliance
tholians
fight
klingons
total
against
retain
searching
breen
begun
active
expansion
difficulty
retaking
collective
developed
internal
factions
freedom
nastier
ruthless
delta
quadrants
largely
unexplored
conflicts
citizens
desired
lasted
akin
pax
romana
taking
conflict
enemies
tired
isolationist
mentality
spread
land
dimmed
must
commit
minimum
apathetic
complacent
lethargic
unmotivated
joining
means
anymore
complacency
infiltrating
attempting
deteriorate
inside
encouraging
corruption
petty
disputes
rivalries
dumbing
clearly
secretive
divide
conquer
strategy
overarching
title
appear
explorers
premise
president
feels
passionately
reenergized
sent
publicized
bajoran
wormhole
initiative
attempt
reignite
nostalgia
calls
isolationists
disturbed
protests
erupt
sabotage
attempted
encounters
nonhumanoid
species
humanoids
warm
towards
discrimination
hold
dear
exploring
increasing
turmoil
immune
happenings
continues
pulled
microwormhole
detection
technology
visits
pod
detected
meanwhile
continuing
filled
races
discovers
humanoid
created
xenophobic
sorts
discriminate
nonhumanoids
isolated
scared
primitive
civil
splinter
faction
seceding
worthy
darkest
fortune
reignited
move
together
boldly
united
falls
pieces
realize
preventing
plunging
dark
ages
endless
territorial
peacekeeping
born
ashes
symbol
unity
replaced
opposing
enters
finding
friends
due
decides
forge
alliances
break
prejudices
interruption
appearance
mix
importantly
constant
testing
morals
biggest
oddly
favorite
race
compelling
closest
recall
offscreen
cast
constitution
class
marveling
futuristic
felt
60s
st2009
backwards
countermeasures
studio
laughed
stories
details
filming
asking
1960s
fashion
cyclical
hundred
informed
30
dollars
answering
crashing
mads
mikkelson
raul
muthafuckin
esparza
svu
extremely
talented
stage
asshole
sympathetic
easily
excelling
garaktype
imgurcomr0wt24s
trending
category
trust
etc
subjective
profile
changes
usa
x
files
sitting
germany
waiting
arrive
hologram
hahaha
canada
vash
memoryalphawikiacomwikivash
binge
lately
finished
currently
ep
lol
im
lauhging
thank
didnt
upvoted
aussie
night
socalled
section
suggestions
standup
near
titles
standups
happening
nearing
suspect
built
users
match
habits
represents
global
behavior
positing
perhaps
significant
sincerely
richard
nixon
flatmate
month
forgot
romance
westley
robin
amuses
moan
crapping
mindset
younger
tape
vcr
changed
sat
payed
aside
misplaced
expectations
supposed
true
meant
pacing
issues
flak
jarringly
color
pallet
pastel
uniforms
handled
expecting
status
quo
tack
cold
distant
_exactly_
poorly
underfunded
captures
worthwhile
stumbles
earned
arbitrary
receives
surface
level
tries
contemporary
911
justification
corrupt
military
leadership
hollow
waste
spent
supports
constructed
thin
favor
shootout
fist
goal
tragic
inkling
hints
plotline
circumstances
push
past
aggressive
introduced
mindless
decent
slick
darn
typo
origin
1701d
uses
opposed
26
operates
three
shifts
jelico
rotation
ab
episide
referenced
commanded
noncannon
wwwyoutubecomwatch
g4apqrbhqp8
nine
pathetic
desperate
hopefully
throw
sympathy
beautiful
eaten
andor
medicine
tougher
practices
mokbara
meaning
complaining
bones
properly
commiserate
theres
seasons
sg1
atlantis
number
entrenched
contesting
episodic
cgi
serialized
models
artistic
techniques
eyes
reallys
pick
movingcamera
shots
improve
comedies
dwarf
hyperdrive
bbc
slicker
bettermade
standpoint
lots
themes
understands
cheesy
failure
touches
pain
disappointed
post911
imagination
shrunk
imagined
impossible
vger
god
hokey
reduced
homeland
security
terrorism
fascinating
heck
local
knowledge
judzia
herself
infinitely
gettable
league
shot
couple
keiko
dunno
bsg
finest
fiction
amazing
dollhouse
80
scifi
dune
mutiny
stressful
silence
predator
dinner
reference
uss
cvn
65
4600
ncc1701
430
seven
selar
injured
undoubtedly
sisqo
cook
baseball
noises
burns
feet
sand
vignette2wikianocookienetmemoryalphaimages66aantedean_dignitaryjpgrevisionlatest
cb
20121126173006amp
pathprefix
en
sack
potatoes
supply
fish
beach
aped
twok
khaaaann
uncomfortable
crack
mum
blew
brink
commanding
died
meld
betrayed
highranking
smashed
front
spockprime
fuckin
st6
happened
protege
tried
smash
mindrape
public
peter
weller
admiral
marcus
benedict
cumberbatch
stellar
whitewashing
ricardo
montalban
mexican
spaniard
brownface
bothering
necessary
reappearing
especially
exception
granted
major
serve
tie
larger
shirt
increases
chances
exactly
becausewell
pretend
wrote
thoughtful
pervy
symbiote
able
bang
theory
novels
romulus
chrihan
remus
chhavran
rihannsu
farscape
rebels
lane
adopt
native
indigenous
artifact
burning
kronosqonos
homeworld
kling
glory
rebel
imperial
government
traitors
kids
drop
concentrate
documentary
aware
deals
behindthescenes
treks
resurrection
itunes
itunesapplecomuspodcastrulesacquisitionstartrekid1082593954
soundcloud
soundcloudcomrulesofacquisitionpod
yesterday
breaking
patch
s2
s3
slog
moreover
engages
tight
reputation
worrying
fall
reasonable
crossovers
neat
janeways
semimeta
selfdeprecating
jokes
zero
dilute
arcs
unparalleled
manny
coto
aspects
aesthetic
became
colorful
transporter
pad
groovier
ama
asked
costumes
grown
resemble
intended
gradually
canceled
transition
planned
change
mentioning
differences
betazed
ferenginar
bajor
indeed
bigger
budgets
seaquest
submarine
marine
fighter
pilots
behind
xfiles
exosquad
animated
sadly
dvd
clock
chair
virtually
og
e
defiant
torpedo
lockout
self
destruct
res
quicktime
vr
dti
books
chris
l
bennett
earl
grey
sucker
repeat
viewer
sensors
incredibly
cannons
shields
ineffective
photon
spatial
tractor
automatic
doors
gods
sake
2000
1960
limited
spoilers
significantly
nx
mirror
shred
spoiler
medicalline
automatically
departments
psychological
regulations
demonstrated
xo
careers
charge
teams
onboard
group
pen
pals
trained
commandline
chosen
formality
department
sickbay
honourary
kobayashi
maru
career
respond
simulation
deforest
kelley
effort
act
scott
scottish
accent
theatrical
incarnation
stealing
coat
paint
treklore
surprised
brilliantly
laced
metaphors
noend
refer
timholmesblogwordpresscom20140701theworldsendandtheendofcapitalism
semi
depressing
46
critism
moreso
overdo
according
birthday
hitchhiker
guide
themed
gem
200
summer
holidays
vacation
concrete
useful
underpowered
early
photons
suggest
outline
weaponry
slimmer
add
props
postproduction
videos
buttonscontrols
physical
buttons
lcars
os
cpm
custom
common
computers
msdos
tragedies
failing
followup
further
menagarie
hostile
noname
fields
assumed
lessons
crash
piloting
lancie
autistic
working
spaced
horrendous
backstage
anecdote
uniform
costume
competent
dress
dabo
obsession
tonnes
favorites
rebooted
orc
geordie
quark
shut
suite
juicy
valentines
profit
5g5qtwg5oo8
married
rights
son
leaving
civilized
nerd
bone
smiling
randy
quaid
tasha
snuggling
ready
rainbow
offensive
notch
redo
wok
lazy
plugs
trans
beaming
reused
theatres
left
theatre
hey
plan
suddenly
beloved
steamrolled
carelessly
sentiment
mishandled
frustrating
evident
garantee
3x
intrigue
miles
deserted
personable
sing
louie
repopulate
dream
futile
statictvtropesorgpmwikipubimagessybokjpg
mom
violated
attacks
hmmmmm
guinan
pleasant
letting
introvert
myself
needed
luck
meaninglessly
arrange
landscape
drone
o
brian
ultimate
bro
tough
nails
botany
plants
edible
medicinal
mention
hawt
literally
knowing
allergic
equally
grumpy
mot
lonely
hair
fleek
suffer
chakotay
hoshi
basket
kell
perimgoogle
pics
exit
eden
ruins
evil
nympho
bitch
wink
outrank
assigned
chaplain
normally
broaden
qualifications
passed
contingent
harder
explain
pulaski
possibly
discretion
contrived
naomi
glasses
dammn
conan
memoryalpha
setused
item
sold
auction
fortunate
win
20062008
memoryalphawikiacomwikiits_a_wrap
_sale_and_auction
nimoy
narrated
highlighting
discovered
items
price
500000crazy
wwwchristiescomlotfindersalebrowseaspx
intsaleid
20723amp
viewtype
listamp
sortamp
sid
03c1257865a24af5ad4fea3f7d7b480camp
sortby
ehigh
bidding
pressed
latinum
bunch
selfsealing
stem
bolts
hidden
shitty
bland
blockbuster
avid
trekkie
writer
messiah
justin
lin
growing
directors
hollywood
helming
furious
welldirected
starstudded
ensemble
vin
diesel
dwayne
johnson
paul
walker
michelle
rodriguez
among
john
cho
cautiously
hyped
sloppy
09
intellectual
step
mistakes
screw
stoked
enter
9th
held
whose
katra
karl
urban
expand
quinto
jesus
stereotype
blech
yea
relationships
ups
downs
chick
flick
kazon
leaders
meeting
sound
somewhat
silly
ceremonial
horns
whistling
clapping
willing
bugle
prerecorded
stock
speakers
whenever
sitcom
minute
claim
version
propensity
vanity
egocentric
speculated
somehow
copy
6um2aot_vl8
actress
ears
grocery
stores
foods
wrappages
owns
bar
cardie
ya
ale
aphrodesiacs
tribbles
ask
odo
wwwtherobotspajamascomwpcontentuploads201304stp15jpg
adding
statistic
plowed
uk
none
knocked
park
choices
replay
fights
rules
saving
ads
heaven
unstar
sentiments
contributor
presumably
overlooked
backup
rewrite
ones
comfortable
alter
flagship
algorithms
wiping
abilities
opponents
hb
mr
portrayal
quick
recap
mysterious
scans
everybody
selectively
wiped
blocked
similarly
unavailable
firewalled
useless
devises
brainstimulation
treatment
restore
infiltrator
cmdr
macduff
fakes
seizure
prevent
exposes
unravels
explained
exposition
stimulator
mentions
poor
fate
appears
applied
restored
overlook
hurry
franz
joseph
published
1975
isbn
0345340744
device
passive
magnetic
storage
disk
ran
flash
today
fixed
chip
powerful
1995
runs
accesses
sd
card
wear
holes
disks
vm
filesystem
accessed
block
linux
extracted
lotus
pasting
notepad
word
processor
file
linuxdienetman5cpm
warrior
aesthetically
lady
dug
toughest
cavemen
attacked
foreheads
evolutionarily
evolved
equivalent
simians
butt
heads
dominance
terran
rams
celebrate
drinking
laugh
terrans
bump
chests
misread
post
headrests
chairs
newbie
unable
provide
spockbones
friendship
busting
balls
bantering
bickering
personalities
reigned
ment
situated
stng
proven
doubt
immensely
record
chuckled
silliness
applause
culluh
selection
delve
pitched
pitch
product
stages
iconic
developing
learn
history
covered
conception
reception
hearsay
friendly
amongst
terry
farrell
rick
berman
pay
rise
supposedly
shortly
treated
headed
stepchild
paramount
consistently
110th
audiovisual
material
served
prototype
shockingly
concerning
voyageri
interfered
crews
upn
nixed
extent
oversight
blog
darthmojowordpresscom20080620scificandyvoyagerstrikesback
renders
linked
transfer
rerendering
fb
lowres
popularity
mahge
psychologically
affect
legos
rocks
flying
explosion
missing
occasional
podcaster
signals
interview
scientists
nonscientist
interviewed
les
adviser
nasa
concepts
office
soundcloudcomboldsignalss2e7solarsailinglesjohnson
conversation
covers
ranging
tennessee
valley
workshop
relevant
interests
influence
reciprocal
delighted
dig
itunesapplecomuspodcastboldsignalsid993499022
stitcher
wwwstitchercompodcastjohnborghiboldsignals
soundcloudcomboldsignals
incidentally
soundcloudcomboldsignalss1e3thebestofbothworldswithphilborghi
soundcloudcomboldsignalss1e10miningneutrinoswithstevemaguire
discuss
catalyzed
entail
sequences
odds
rid
requires
navigator
communications
focused
intent
portray
hurtle
machine
trade
boat
load
sealing
girlfriend
introduce
necessarily
themselves
whodunnit
measure
dillemas
crop
duet
bajorcardassia
fantastically
acted
deadlock
require
mulgrew
lien
puzzle
kim
correct
catwalk
piece
incident
shout
tense
rely
jemhadar
summarizes
honestly
scorpion
eye
needle
excluding
hands
arena
hooked
devil
introduction
spectrum
roman
offhand
strange
adversary
imo
oriented
digestible
villains
feared
finishes
promise
escalating
backstory
pique
interest
pale
moonlight
overview
packed
pre
7of9
statement
trapped
subspace
sinkhole
escape
random
journeys
introductory
represent
fully
captive
pursuit
tosk
resolving
disagreement
bending
accommodate
whoever
outdid
jean
luc
specs
mysteries
asteroids
droids
telepathic
betazoids
deadly
claw
visitor
law
gone
berserk
craft
rites
parasites
heights
hanging
thread
celebration
transformation
battle
crushed
tube
grubs
spices
raktajino
ijs0hhozfq
ozwmoi5tyqs
lwa0ixa7q
hm
shipsthe
camera
typically
spotlight
hearing
progress
react
implemented
opportunity
path
contain
proud
storylines
hampered
nudged
undesirable
direction
meet
shooting
advice
speak
shortage
dvdbluray
transcripts
panel
oneoff
interviews
wellproduced
market
tagged
added
posting
wall
pm
imgurcomavfnhq
lights
understatement
hiring
hype
meter
threw
roof
announcement
longshot
fancasting
finale
late
projections
setting
typical
informative
caretaker
nog
bargaining
gmc
suggested
offered
stops
cant
fit
jake
explains
flaw
bargain
stepping
stone
proved
convincing
professionals
lawyer
psychologist
maintain
dignity
denominator
gore
brow
intermix
seamlessly
mill
slasher
deeper
complex
skillful
adapting
seeming
wikipedia
page
massive
psychology
voiced
strongly
visuals
admits
openly
writes
lens
screenplay
considering
intensely
frontrunner
sciency
imagery
delivering
wasted
filler
amounts
blessing
trivial
master
revealing
hiding
shock
villans
resonate
gul
dukat
tamerlane
chang
nutrek
establish
furthers
villainy
ps
xpost
rtlhinganhol
ushanoxilt
wwwredditcomrtlhinganholcomments460htwhow_to_be_a_klingon_male
bot
convenience
mobile
wwwredditcommessagecompose
originalpostsearcher
code
githubcompapernotesredditoriginalpostsearcher
faq
happen
scope
ixckr3o6frc
destined
clash
nuuniverse
thick
curly
capes
helmets
idk
ridiculousness
interact
establishes
precident
existing
rebootingremaking
s06
obrian
buffyangel
telling
worry
safely
often
raised
questions
dominion
partially
answered
novel
gameplay
remade
agrees
pipe
bioware
secure
mass
effectlike
knights
republic
epic
telltale
pointandclick
tone
25th
anniversaryjudgement
ritesa
armada
fond
puzzles
untrek
assets
owned
holobyte
merged
microprose
bought
hasbro
infogrames
business
company
bandai
namco
startreklistblogspotcom201104listofallstartrekepisodessorted_05html
birthright
guest
bloodlines
penultimate
preemptive
strike
organisation
maquis
formation
detailed
relatively
alternating
appreciate
finish
substantive
easier
entirety
afterward
gog
unreal
engine
overhaul
cd
stored
486
vo
dust
revisit
teen
differentiate
log
middle
user
umhb210
selected
s01
s02
s03
contrary
views
sit
150
bandwidth
contradictory
whaaaat
stride
s1
uneven
subsequent
excellent
contains
defining
vary
widely
inoffensive
176
trim
threads
tor
guidelines
equal
technobabble
particle
introspective
humanism
skewed
huminisim
voyagerent
debates
turning
intense
cerebral
deconstruction
protect
s4
payoff
s5
s6
holds
barred
dozens
hundreds
occurrence
millions
tragedy
glorious
culminates
crescendo
polaron
beams
quantum
torpedos
short
tedious
eg
prologue
vedek
winn
louise
fletcher
dramatis
personae
predictablestereotypical
shines
performances
nana
finishing
referring
implementation
bothers
1000
roughly
stardate
ranges
1312
5928
2265
2269
suggesting
indicate
13006000
4100048000
minus
2360
reconciled
accurate
tied
annoying
exact
examination
stardates
starchivecsumanitobaca
theorizes
began
founding
ufp
99999
cycling
00000
longer
necessitating
resetting
increased
100000
410000
apocalypse
consensus
et
al
411537
35
2323
extrapolating
recalibrated
corresponds
223304
2233
earthcentric
arrives
nuspock
jellyfish
2387
64000
universallytranslate
sometime
nero
decimal
calendar
0
equals
10000
thousand
27
yeras
omega
digit
denotes
1xxxx
correspond
5xxxx
consideration
resolve
nightmare
rp
characteri
default
relate
unix
epoch
enmwikipediaorgwikiunix_time
k
aboard
soaryn
fc
nod
scarcely
attacking
tbh
bugs
dismiss
filmsshows
groups
iron
nags
jive
wellacted
wellwritten
alongside
portrayed
pirates
thieves
stolen
equipment
electricity
whips
tons
traders
swindlers
psychopath
iggy
commandeer
trick
selling
peanuts
hijack
creative
producers
disappears
pursuing
depart
pursue
entity
bug
missed
event
timing
lining
shared
marvel
unreasonable
argue
badly
comprehensive
wellthoughout
voices
lethian
wandering
scroll
switch
indicator
presume
purgatory
shadow
ferengis
philosophy
assholes
realistic
cultures
centers
correctly
forth
wanting
adventurish
abrams
struck
balance
guilty
pleasure
warmly
remembered
traits
sigh
terrifying
passable
wax
museum
museums
figures
transporters
deage
damned
mishaps
fixing
rush
firstthird
queue
father
impactful
adds
sucked
synopsis
potential
multigovernmental
bureaucratic
backwater
armed
terrorists
triangle
fanatical
bay
threat
bird
prey
paper
imbecilic
honest
poignant
score
contend
redeems
familiar
redlettermedia
plinkett
commentary
bandcamp
redlettermediabandcampcomtrackplinkettsstartrek5thefinalfrontiercommentary
favourites
characterisation
diverse
interacted
_their_
importand
identities
friendships
comfort
whew
staying
rumors
confirmed
pope
dalai
lama
messy
nude
argh
intention
thus
whale
cares
apologizing
preference
romp
franchises
admit
learning
alive
thats
lose
yay
memorized
facial
structure
presence
staring
ambassador
parley
enemy
supernova
motif
malcolm
quit
sourced
throwaway
2013
consider
mistaken
speculation
blackinterest
pinch
salt
whomever
failshe
lay
voodoo
learns
sceneepisode
startrek
ppl
caught
drag
prob
robs
discrepancy
torn
customs
cuisine
intimate
pride
biological
parents
taught
accidentally
killed
soccer
klingonness
differentness
fantasize
involve
adoptive
embrace
fitting
encouraged
replicated
gatekeeper
knew
cling
pun
identity
six
moved
qonos
cousins
performed
rite
ascension
immersion
romanticized
appreciated
hybrid
performing
insecurity
op
wraps
opens
sea
crashes
mcdowell
riding
horses
standing
everytime
halfassed
inconsistencies
switching
sticking
decide
tailored
budgetary
constraints
afford
rant
besides
deaths
plenty
pissweak
survived
previously
badass
nexus
fanfare
remain
ribbon
joy
objectively
thematic
spfx
destroy
butfor
rewatchability
sworn
zapped
podcasts
swing
recommendation
forgive
lack
commission
subsequently
wearing
pips
collar
cadet
unfair
fellow
serving
attend
entry
classes
explaining
basics
unheard
1415
olds
resume
tracked
graduated
traveler
fairness
internships
college
students
studybuddy
truly
challenge
exam
filling
unit
entd
salary
benefits
promote
appointment
permanent
uvwboyaf1
noobfreshmanmaggot
enlisted
chains
sfa
bright
hazing
indoctrination
academies
harsh
words
fret
_my
child_
prophets
kai
annoyingevil
purpose
deserve
condescending
arrogance
deluded
fanatic
uncommon
experiences
attended
newb
newbies
corporal
upper
classmen
foul
mood
laying
buddy
understandably
disappeared
reappeared
proceeded
announce
tits
answers
confuse
flow
oscar
winner
arguments
puts
wynn
superb
guessing
announcements
algorithmically
rip
journalism
soon
contracts
expire
wouldnt
services
rereleased
bluray
owning
metal
ring
kawoosh
puddle
idr
accounts
dialation
inherant
standardized
affer
reasonbto
tge
matching
draws
dramatic
nonhuman
wishful
rylance
ophelia
lovibond
firsttimer
loving
oftstated
jealousy
cousin
ownership
moon
titled
led
success
remind
1980
restaurant
gaggle
girls
booth
overheard
mccartney
band
wings
breathlessly
thirtysix
broken
swipe
upwards
strips
activate
database
overload
explode
pseudosequel
afu
95
disturbing
writting
translated
chinese
wwwempireonlinecommoviesfeaturesstartrek5thingsbryanfullerbringsfranchise
piracy
posts
encouragement
phenomena
beard
shaves
grows
goatee
stopped
freaked
eps
marathon
cry
depends
horror
checkov
woods
bulkhead
jailbreak
daughter
someday
remains
stream
weighing
curiosity
daily
mail
viewed
enjoyable
comparing
jared
harris
mad
sherlock
holmes
mimdbcomnamenm0364813
unnecessarily
inexplicable
flare
capper
fricking
digital
versions
manifest
destiny
included
shuttlebay
gon
na
deeply
17
01
august
reliably
collection
cheaper
sync
bonus
dvds
wwwamazoncomstartrekiidirectorscollectorsdpb0000683dhref
sr_1_1
ie
utf8amp
qid
1455558700amp
sr
81amp
keywords
startrekthewrathofkhandvddirector
27scut
angles
denise
okuda
text
commentaries
repackaged
whichever
inhabit
corner
sketched
cdrom
impressive
rerelease
saratoga
sentences
foreign
ivi
19942002
2009present
option
wwwredditcomrstartrekwikiwhere_should_i_start
october
slowpaced
storytelling
footing
expands
wwwredditcomrdaystrominstitutewikikraetosintrototrek
tend
revolve
reflection
gentlest
sucky
regarded
qualities
seed
st2st3st4
meh
st5
appendage
esteemed
counted
madge
sinclair
st4
mother
hera
tryla
renegade
conspiracy
guarantee
women
underrepresented
proportion
population
logically
overwhelmingly
represented
americans
turned
facts
straight
horribly
dad
grew
remaster
2d
flight
sim
portions
console
cutscenes
clean
resolutions
dosbox
asian
earths
genocide
asia
apprehensive
overly
informational
iimgurcomjltkykkjpg
memoryalphawikiacomwikicardassian_war_room
s03e09
founder
weyoun
damar
squeezed
tiny
monitor
cardassians
showy
facility
miniature
viewsreen
inserted
costs
sfx
decisions
rooms
headquarters
hitlerinthebunker
latter
signs
anybody
intolerable
xp
photograph
enwikipediaorgwikibliss_
image
wallpaper
mysteriously
1988
paradox
willie
mays
13
gap
carol
kick
months
bored
farewell
stands
clouds
wwwstartrekcomuploadsassetsarticlesyar3jpg
betanewscomwpcontentuploads201405xpregjpg
integral
building
regret
skipping
critical
subplots
crucial
relatives
temptation
ron
moore
pattern
edith
keeler
sisterinlaw
kirok
punished
protomatter
genesis
cheating
carrying
trope
annoys
annoyance
respected
intelligent
diplomat
protagonist
bent
regard
overrode
rationality
recovered
realises
committing
wishes
sudden
rambo
countdown
expired
agreement
countries
launches
uncertainty
fancy
wtf
fundamentals
jjverse
misfire
sift
fundamentally
overseas
subs
hulunetflixamazon
calling
drones
toys
rc
quad
saucer
stardrive
electronics
battery
unbalanced
enterprisee
mmmmm
connie
refit
clicked
horatio
hornblower
scores
credit
villians
fame
intruded
divorce
judge
photo
courtroom
autograph
insensitive
sadness
alienated
latched
persona
teenager
listed
controversial
praise
gritty
politically
balanced
depiction
frankly
veneration
trashing
address
1966
whining
glitzy
forest
trees
bothered
sorry
baby
depicting
singlemindedly
determined
defend
defeat
consistent
excess
captured
wage
descendant
trekkies
interpreted
logic
successordescendant
trace
tree
troll
baiting
navigate
_far_
window
dressing
intents
purposes
feature
central
tended
row
_any_
deserved
cancelled
rightly
creatively
burned
tolerant
rightfully
jeri
ryan
garbage
handed
factor
boost
ratings
repeating
internet
stupid
glorified
fanfiction
seasoned
industry
borgwar
crewed
glimpse
tngstyle
mandarin
collars
stb
acknowledge
importance
significance
intend
accurately
embodies
exploratory
funnier
futurist
bathroom
hmm
nowadays
opening
selfrighteous
aristocratic
possessing
flawed
religion
anti
aged
implore
guides
happily
wedding
corny
jerry
goldsmith
wholly
inappropriate
recycled
neither
onscreen
mechanics
4th
counting
tuvok
batshit
douchebag
legacy
outsider
wimp
goofy
moping
drunk
sedate
wry
callous
grittier
garak
trolling
woah
lookwe
uncalledfor
pine
kirkactor
enormously
armour
failhave
destroyedbe
occasions
disregarding
securitytactical
idealism
rarely
rockhard
scenario
dent
challenged
overused
vast
spanning
lightyears
education
academic
engineers
compete
technologically
descent
trump
disgrace
respectattention
21
510
per
derailed
meaningless
solutions
confident
spouted
relied
excessive
visual
nuisance
stake
connected
w
bun
predictable
insert
butthurt
heregt
knocking
emitter
acquired
taste
coffee
nebulae
wrist
communicators
average
belanna
attractive
equinox
professional
allaround
emotion
shutting
hmmm
basset
authoritative
poise
rounded
gscq_mn0evc
weekend
clumsily
plotted
skimps
weirdest
hugging
ren
chokes
ticking
boxes
checklist
hindsight
batonpassing
received
warned
universally
personalized
wwwredditcomrstartrekcomments432vs3so_i_want_to_get_into_star_trek_but_have_no_ideaczfe3w1
assessment
skippable
altogether
dense
odyssey
unpopular
stupidest
probe
nccretirement
home01a
doddling
san
fran
cheap
laughs
ranty
farout
massively
underrrated
depict
utopian
limitations
task
pause
confused
transplant
adore
enterpriserefit
respect
matt
jefferies
designs
upgrade
observant
slender
practical
disadvantage
punch
blast
damage
torsion
enormous
cushions
windowviewer
smaller
exposed
dome
houses
conference
slenderness
pylons
armored
slim
nacelle
leaking
plasma
forces
exerted
nacelles
atrocious
bulkier
tad
beefier
size
supersized
23rd
protein
shake
repetitive
corridors
upscale
beef
necks
salute
beefing
chekov
helmsman
banging
boasting
humiliate
lead
_motherfucking_
storm
halle
berry
underwhelming
hashtag
inevitable
articles
racial
accuse
biased
bigoted
interacial
kiss
bald
hairpiece
nongendered
colors
skin
makeup
par
site
editions
displayed
perfection
humility
kindness
rom
gallifrey
won
masquerade
brilliant
watchlist
glitch
keeping
fingers
crossed
leaves
25
removed
terms
speciescultural
weakest
tnglike
depend
expectation
facets
individuals
societies
idealistic
narrow
interpretation
broader
inconsequential
ahhhh
glue
underlying
threaten
rainbows
puppy
dogs
interaction
_not_
_a
lot_
philosophicalspiritual
route
essential
spiritual
foundations
federationstarfleet
confining
secondary
primary
_especially
_were_
complaint
loyal
formula
ourselves
quickly
workings
politics
_never_
fringes
_good_
carefully
construct
tangible
blunt
_must_
recommending
backtrack
haaaaatttted
practically
boiling
serial
format
sees
liking
lightens
hurrah
genuinely
satisfying
faithfully
elaborate
dresses
interpersonal
comes
unbelievable
outgrow
greed
incapable
dealing
primarily
coexisted
badder
kumbaya
faces
organization
arm
warships
alsothere
barelyhidden
racism
commonly
imperfect
beings
screams
burden
relinquish
clip
slight
slur
hearthhh
russel
watson
beverly
exciting
settles
dramas
thumbs
miners
paid
dilithium
miner
slaves
stuffemissary
embody
staid
safer
ironic
diminish
factually
strength
toetotoe
afterwards
interestingmuch
posthugh
lore
uncreative
combining
queen
revitalized
batleth
idiotic
weapon
technological
exploitation
longterm
split
wound
justified
revive
stv
idiot
phases
tngds9voyager
nostalgic
actively
infuriated
immersive
smashing
comical
vengeful
maniac
superweapon
undeserved
tilting
irredeemably
lump
click
maxed
conform
foundation
marred
poverty
disease
luddite
bioethics
tremendous
personhood
quaint
waysneural
integration
machines
combines
ghost
shell
cowboy
bebopfirefly
throws
follows
sophisticated
justify
reimaging
addressed
cow
basiclly
stead
till
tarnish
grand
nagus
precisely
majority
uniting
peoples
backed
eugenics
1990
foolish
pushed
ahead
separated
realworld
prematurely
bore
wwwredditcomrdaystrominstitutewikialgernonguide_ds9
bruv
disguised
motives
voyagerso
supreme
court
lower
decision
upheld
stances
courts
concludes
unions
voting
advocates
blocking
scotus
nominee
ruling
virginia
gerrymandering
regrettable
recede
emerge
titan
constitutional
principled
dedicated
devoted
undermines
headline
defending
underdog
punching
oppressors
modeling
christian
virtues
muslim
deeds
scalia
originalism
cherrypicking
sophistry
claims
channeling
authors
dubious
2nd
amendment
clause
omitted
uninterpreted
founders
unlimited
campaign
donations
speech
protected
account
exonerating
capital
election
recount
voters
smug
comforted
shat
guise
principle
leads
coincidence
rewarding
sides
disagree
aggressively
regressive
agenda
submission
outspoken
liberal
conservative
tr
inept
submissions
downvotes
unfortunately
frontpage
appropriate
subreddits
votes
pages
note
wwwredditcomrtrueredditcomments4276wabernie_sanders_spoke_truth_about_rape_when
wwwredditcomrtrueredditcomments425q81is_it_still_possible_to_get_away_with_a_heist
configure
automoderator
subscribers
remove
rtrtest2
belong
redditors
objection
removes
process
wwwredditcomrtrtest2comments42cdkhhow_to_win_an_election_an_ancient_guide_for
limit
removal
mistake
battleground
candidate
belongs
tool
poorer
inadequate
spam
statements
definite
requirement
formatting
requirements
copypasted
autodeleted
flagged
sidebar
submit
masse
suppose
commenters
reddit
replies
submitted
nuked
method
implement
ensure
columbine
brooks
brown
wwwredditcomcommentsgulafiama_columbine_survivor_named_brooks_brown_i_was
referencing
cullen
definitive
dismissive
bullying
factors
8th
grade
brutally
bullied
7th
graders
ashamed
kinds
rampages
fault
parent
bubble
blamed
torment
secret
temporaryit
journalist
coverage
antivaccination
efforts
dating
1980s
couched
derided
antiscience
noting
digs
rejection
paying
argues
antiauthoritarian
resisting
mandatory
vaccination
rejecting
misunderstanding
benefit
posits
scientific
implications
publichealth
remote
town
arctic
caribou
northern
frigid
winters
highway
essay
developments
mekong
river
interwoven
crucially
flows
editorializing
jewhating
idiots
sweden
ignorant
jealous
hatred
gd
propose
invisible
therefore
faeries
ghosts
enact
pigouvian
taxes
eliminate
externalities
solve
climate
crisis
trash
losers
slandering
consequences
oldest
forums
usersubmittedcontent
rethought
improved
discusses
approaches
detail
provides
ny
nyt
interestingpeople
statistically
present
hunter
gatherer
civilizations
mortality
rates
illnessessuffering
literacy
reported
rate
intertribal
rationalizing
brutalities
sneaky
hunky
dory
acceptable
comforting
247
cycles
saturated
brutal
horrific
unprecedented
scalei
fear
matches
spark
conflagration
heal
injustices
ideal
strangely
dcl
jersey
crtlf
pinker
hits
plagiarization
stephen
angels
wwwamazoncomthebetterangelsournaturedp1491518243
upward
trends
graphs
crest
batting
intelligence
immense
challenges
resource
overpopulation
followon
achievement
productivity
burdens
doubts
hilary
nomination
hillary
packaged
democratic
corporate
masters
equation
rigged
verification
independent
party
scream
guns
ban
criticisms
sensible
objections
proposal
warrant
careful
fullscale
evaluate
disappear
determine
oxford
economist
origins
wealth
economy
richer
believes
prosperity
bullshit
truisms
trot
facing
horeshit
100x
mere
progressed
soceity
centuries
proves
merits
arrived
improvement
outcomes
20
300
scored
sick
democratizing
moderation
overrun
insightful
blogposts
racerelations
feminism
ignored
conformed
preestablished
unsourced
allowing
censor
briganding
indepths
research
inequality
negative
economic
stave
solitude
continuous
imaginative
enables
integrity
lest
productive
addicted
entangled
degree
venture
capitalist
envisioned
ecosystem
vs
economies
function
correctness
censorship
ideological
insecurities
federal
specifies
justices
refuse
appoint
jaros
aw
kaczy
ski
leader
poland
justice
midranking
anticommunist
solidarity
movement
increasingly
authoritarian
beliefs
conspiracies
contextualises
wider
polish
poles
prosperous
existence
refusal
largest
resorting
demanding
assault
sexual
relations
imply
trillions
creation
daesh
blowjob
currency
nobles
distance
vaccinations
consequence
borne
schools
hospital
transportation
restrictions
hotels
apartment
buildings
malls
prominently
display
noncomplacence
rational
borlaug
wheat
vaccines
plainly
spoken
subject
billionaires
linda
mcquaig
neil
printed
canadian
apply
pee
wees
playhouse
oak
flats
arizona
beautifully
lovingly
peewee
herman
surreally
breakthrough
successes
reubens
arrested
indecency
amusing
bingewatching
tapes
preparation
considers
talent
navigation
mature
teases
reviving
weakness
alludes
arrest
misconduct
1991
accused
masturbation
pornographic
attempts
cover
offering
sheriff
newspaper
indicates
capitalism
solving
driving
tesla
exxon
policy
proposals
economics
hypothetical
solution
disbanded
replacing
democracy
warming
untill
elites
international
governance
bitcoin
westerners
govern
businessmen
profits
dev
communist
notion
victims
unhelpful
thoroughly
discredited
victim
cops
murderer
prove
sky
broccoli
observe
statistical
confidence
levels
blackstone
enwikipediaorgwikiblackstones_formulation
implies
91
guilt
imprison
ghomeshi
prison
accusers
accuser
attack
frighteningly
violence
acquaintances
accompanied
alcohol
consumption
specifics
passing
judgment
regardless
crown
utterly
trial
anger
prosecution
blindsided
defense
testimony
emails
supplying
legal
witnesses
prepared
excusable
gamed
upvotes
visibility
inevitably
partisan
basis
abuse
visible
legitimate
gun
abortion
wwwthebigsortcomhomephp
liberals
francisco
brooklyn
portland
progressive
conservatives
rural
area
supportive
republican
bet
smallminded
dnc
swore
fealty
semblance
tribal
partisans
democrats
republicans
respectively
tribe
locked
players
filthy
rich
petitions
tweet
tumblr
racist
ewwwww
candidates
punishing
waiver
donor
wellbeing
outright
dehumanize
presumes
sanders
oppose
clinton
nor
policies
activities
democrat
independenti
espousing
concerts
sincere
historically
